const TEMPLATES_TICKET = {
    "Оск": "Выдан пред за оскорбление",
    "Провокация": "Выдан пред за провокацию",
    "Обход": "Обход чист",
    "Препятствие": "Выдан пред за препятствие",
    "Мониторинг": "Выдан пред за мониторинг",
    "Ник": "Выдан пред за ник",
    "Расизм": "Выдан пред за расизм",
    "Спам": "Выдан пред за спам"
};

const TEMPLATES_NOTIF = {
    "Оск": "Пожалуйста, не оскорбляйте игроков.",
    "Провокация": "Не провоцируйте других игроков.",
    "Препятствие": "Не препятствуйте нормальной игре другим.",
    "Мониторинг": "Не мониторьте информацию.",
    "Ник": "Ваш никнейм некорректный. Пожалуйста, измените его.",
    "Расизм": "Пожалуйста, не используйте расистские выражения.",
    "Спам": "Пожалуйста, не спамьте."
};

const COMPLAINT_TRIGGERS = ["крутилка", "крутилкой", "крутится", "krutilka", "krutilkoy", "hvh", "hwh", "хвх", "rage", "рейдж"];

const CYBERSHOKE_MUT_RULES = [
    {
        name: "Расизм / дискриминация",
        keywords: ["аллах", "алах", "alah", "allah", "nigga", "niga", "nigger", "niger", "negr", "hohol", "xoxol", "негр", "ниггер", "нигга", "нига", "хач", "хохол", "кацап", "чурка", "свастика", "расизм", "нацист", "хохл", "черножоп", "черномаз", "казах", "циган", "цыган", "пендос", "пиндос", "pendos", "холоп", "holop", "xolop"],
        duration: 4320,
        severity: 10
    },
    {
        name: "Реклама",
        keywords: [".com", "https://", "стрим", "stream", "youtube", "промокод", "вступайте в", "стримлю", "twitch", "твич"],
        duration: 1440,
        severity: 8
    },
    {
        name: "Токсичность",
        keywords: ["мать", "матери", "матух", "мама", "мамк", "маме", "маму", "mom", "mother", "mam", "отец", "отцу", "папа", "папе", "бабка", "бабку", "батя", "отчим", "сын", "сын бляди", "сын шлюхи", "семья", "семью", "sin", "syn", "son of", "родословн"],
        duration: 720,
        severity: 9
    },
    {name: "Попрошайничество", keywords: ["подпишись", "лайк", "попрошай", "кейс"], duration: 720, severity: 6},
    {
        name: "Оскорбление",
        keywords: ["петух", "уебищ", "уёбищ", "уеб", "уёб", "урод", "ишак", "чмо", "4mo", "4мо", "chmo", "еблан", "пидор", "пидр", "педик", "даун", "хуесос", "дурак", "клоун", "тупой", "идиот", "idiot", "гандон", "гондон", "шлюх", "шалав", "шавк", "хуйло", "бич", "мразь", "тварь", "фрик", "долбоеб", "долбоёб", "долбаёб", "долбаеб", "далбаеб", "далбаёб", "далбоеб", "далбоёб", "терп", "мудак", "бляд", "выблядок", "ебанат", "дура", "fat", "bitch", "faggot", "retard", "daun", "dayn", "pidor", "pidr", "shlyh", "shluh", "dolbaeb", "cloyn", "clown", "eblan", "huesos", "tvar", "dog", "нытик", "ебен", "аутист", "autist", "обезьян"],
        duration: 360,
        severity: 7
    },
    {
        name: "Троллинг/провокация",
        keywords: ["сосать", "плачь", "иди нах", "idi nah", "idi nax", "poshel na", "соси", "ez", "izi", "лох", "bot", "бот", "sosi", "саси", "отсос", "посос", "потеет", "потей", "потеешь", "бомж", "нищ", "нищий", "нищета", "немощ", "лошар", "лошпед", "изи", "слаб", "ебал", "noob", "нуб", "suck", "мясо", "пес", "пёс", "so bad", "обоссали", "обоссан", "ебаный", "ебанный", "лсны", "лсы", "олух", "обижен", "позор", "выеб", "krip", "крип"],
        duration: 360,
        severity: 5
    },
    {name: "Спам в микрофон/чат", keywords: [], duration: 360, severity: 4},
    {name: "Изменение голоса", keywords: [], duration: 360, severity: 3},
    {name: "Мониторинг", keywords: [], duration: 360, severity: 2}
];