const TEMPLATES_TICKET = {
    "Оск": "Выдан пред за оскорбление",
    "Провокация": "Выдан пред за провокацию",
    "Обход": "Обход чист",
    "Препятствие": "Выдан пред за препятствие",
    "Ник": "Выдан пред за ник",
    "Спам": "Выдан пред за спам"
};

const TEMPLATES_NOTIF = {
    "Оск": "Здравствуйте! Пожалуйста, не оскорбляйте игроков.",
    "Провокация": "Здравствуйте! Не провоцируйте других игроков.",
    "Препятствие": "Здравствуйте! Не препятствуйте нормальной игре другим.",
    "Ник": "Здравствуйте! Ваш никнейм некорректный. Пожалуйста, измените его.",
    "Спам": "Здравствуйте! Пожалуйста, не спамьте."
};

const COMPLAINT_TRIGGERS = ["крутилка", "крутилкой", "крутится", "krutilka", "krutilkoy", "hvh", "hwh", "хвх", "rage", "рейдж"];

const CYBERSHOKE_MUT_RULES = [
    { name: "Расизм / дискриминация", keywords: ["негр", "ниггер", "нигга", "нига", "хач", "хохол", "кацап", "чурка", "свастика", "расизм", "нацист", "хохл", "черножоп", "черномаз", "казах"], duration: 4320, severity: 10 },
    { name: "Реклама", keywords: [".com", "https://", "стрим", "stream", "youtube", "промокод", "вступайте в", "стримлю", "twitch", "твич"], duration: 1440, severity: 8 },
    { name: "Токсичность", keywords: ["мать", "матери", "матух", "мама", "мамк", "mom", "mother", "mam", "отец", "папа", "бабка", "бабку","батя", "отчим", "сын", "семья", "семью", "sin", "syn", "son of", "родословн"], duration: 720, severity: 9 },
    { name: "Попрошайничество", keywords: ["подпишись", "лайк", "попрошай", "кейс"], duration: 720, severity: 6 },
    { name: "Оскорбление", keywords: ["петух", "уебищ", "уёбищ", "уеб", "уёб", "урод", "ишак", "чмо", "4mo", "chmo", "еблан", "пидор", "пидр", "педик", "даун", "хуесос", "дурак", "клоун", "тупой", "идиот", "idiot", "гандон", "гондон", "шлюх", "хуйло", "бич", "мразь", "тварь", "фрик", "долбоеб", "долбоёб", "долбаёб","долбаеб", "далбаеб", "далбаёб", "далбоеб", "далбоёб", "терп", "мудак", "бляд", "выблядок", "ебанат", "дура", "fat", "bitch", "faggot", "retard", "daun", "dayn", "pidor", "pidr", "shlyh", "shluh", "dolbaeb", "cloyn", "clown", "eblan", "huesos", "tvar", "dog", "нытик"], duration: 360, severity: 7 },
    { name: "Троллинг/провокация", keywords: ["сосать", "плачь", "иди нах", "idi nah", "idi nax", "poshel na", "соси", "ez", "лох", "bot", "бот", "sosi", "саси", "отсос", "посос", "потеет", "потей", "потеешь", "бомж", "нищ", "нищий", "нищета", "немощ", "лошар", "лошпед", "изи", "слаб", "ебал", "noob", "нуб", "suck", "мясо", "пес", "пёс", "so bad", "обоссали", "обоссан", "ебаный", "ебанный", "лсны", "лсы", "олух"], duration: 360, severity: 5 },
    { name: "Спам в микрофон/чат", keywords: [], duration: 360, severity: 4 },
    { name: "Изменение голоса", keywords: [], duration: 360, severity: 3 },
    { name: "Мониторинг", keywords: [], duration: 360, severity: 2 }
];